---
kind: method
id: M:Autodesk.Revit.DB.HasNoValueFilterRule.#ctor(Autodesk.Revit.DB.ElementId)
source: html/2245f530-a8e5-e1ac-0cb0-f87b3e6447c9.htm
---
# Autodesk.Revit.DB.HasNoValueFilterRule.#ctor Method

constructs an instance of HasNoValueFilterRule.

## Syntax (C#)
```csharp
public HasNoValueFilterRule(
	ElementId parameter
)
```

## Parameters
- **parameter** (`Autodesk.Revit.DB.ElementId`) - The parameter that an element must not have a value for to pass this rule.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null